LEXICON: dict[str, str] = {
    '/start': f'🤖 Привет, $$NAME$$ меня зовут GTRobot\n'
              'Вместе мы делаем торговлю легкой и эффективной.',
    '/help': '<b>Это бот-читалка</b>\n\nДоступные команды:\n\n/beginning - '
             'перейти в начало книги\n/continue - продолжить '
             'чтение\n/bookmarks - посмотреть список закладок\n/help - '
             'справка по работе бота\n\nЧтобы сохранить закладку - '
             'нажмите на кнопку с номером страницы\n\n<b>Приятного чтения!</b>',
}


LEXICON_START_MENU: dict[str: str] = {
    'trading instruments': "Торговые инструменты💼",
    'about_the_bot': "Как работает бот ? 🤖",
    "contact": "Связь 📞",
    "about us": "О нас 🌐",
    "referal": "Реферал ☎️"
}


LEXICON_TRADING_INSTRUMENTS: dict[str: str] = {
    'text': 'Рабочие инструменты:',
    'Copy Trading': 'Copy Trading',
    'gtr_trade': 'GTR trade',
    'analitika and signals': 'Анализ & Сигнал',
    'monitoring': 'Мониторинг',
    'earning_tokens': 'Заработок токенов',
    '2p2_arbitration': 'P2P Арбитраж',

    'sec_cloud_mining': 'Cloud Mining',
    'sec_empty': ' ',
    'sec_buy': 'Купить подписку',
    'sec_home': '🏠'
}

LEXICON_COPY_TRADING: dict[str, str] = {
    'text': '🤖Этот инструмент позволяет отслеживать и копировать\n сделки ТОП трейдеров биржи Binance.',
    'selling_subscription': 'Использовать'
}

LEXICON_SELLING_SUBSCRIPTION: dict[str, str] = {
    'text': 'Чтобы воспользоваться услугами робота нужно приобрести \n'
            'подписку через бота или связаться с менеджером: @Granduzb',
    'mini': 'MINI',
    'standart': 'STANDART',
    'gold': 'GOLD',
    'gtr_pro': 'GTR PRO',
    'vip': 'VIP💎',
    
    'sec_back': '⬅️'
}

LEXICON_GTR_TRADE: dict[str, str] = {
    'text': 'Выберите тип торговли:',
    'crypto': 'Crypto',
    'stock': 'Stock',
    'sec_back': '⬅️'

}

LEXICON_CRYPTO: dict[str, str] = {
    'text': '🤖Этот инструмент позволяет торговать на нескольких \n'
            'биржах, не выходя из платформы Telegram. Вы можете \n'
            'открывать сделки топ-трейдеров вместе с ними на своем счету \n'
            '(спот или фьючерсы). Торговля доступна на биржах Binance, \n'
            'Bybit, Okx, Gate, Bitget с установкой TP/SL.',
    'selling_subscription': 'Использовать'
}

LEXICON_CONTACT: dict[str, str] = {
    'text': 'В настоящее время менеджер онлайн: @Granduzb 👈🏼',
    'sec_back_menu': '⬅️'
}

LEXICON_REFERAL: dict[str, str] = {
    'text': 'В настоящее время менеджер онлайн: @Granduzb 👈🏼',
    'sec_back_contact': '⬅️'
}

LEXICON_ABOUT_US: dict[str, str] = {
    'text': '<strong>О нас</strong> \n\n'
            'В 2020 году проект «Grand Trade», основанный Тимуром \n'
            'Хасановым, одним из первых запустил образовательную \n'
            'систему по работе и торговле криптовалютами в Узбекистане. \n'
            'Этот проект успешно зарекомендовал себя на рынке и \n'
            'насчитывает более 13 000 студентов из Узбекистана, России и Европы.'
            '\n\n\n'

            'В 2022 году Тимур Хасанов и другие опытные трейдеры, под \n'
            'руководством проекта Grand Trade создали Сигнальный робот \n'
            '"GTRobot" который включает в себя необходимые инструменты \n'
            'для «Криптотрейдинга». В настоящее время у GTRobot более \n'
            '2500 пользователей, и он помогает многим людям вывести \n'
            'свою торговлю на новый уровень. Наша следующая цель — \n'
            'расширить возможности GTRobot и стать самым мощным \n'
            'сигнальным роботом в Центральной Азии.\n\n\n\n'
            '<strong>Следите за нами</strong>'
            ' \n\n'
            '<a href="https://t.me/+yb0XnJTEoV5iYzdi">Бесплатные курсы по трейдингу </a>'
            ' \n\n'
            '<a href="https://t.me/+iPPLOLcf14gwMTJi">Telegram канал</a>'
            ' \n\n'
            '<a href="https://instagram.com/khasanov_gt?igshid=YmMyMTA2M2Y=">Instagram</a>'
            ' \n\n'
            '<a href="https://www.tiktok.com/@khasanov_gt?_t=8aANJp2bG3m&_r=1">Tiktok</a>'
            ' \n\n'
            '<a href="https://grand-trade.uz/">Website</a>'
            ' \n\n'
            '<a href="https://youtube.com/@Khasanov_Gt">Youtube</a>'
            ' \n\n'
            '<a href="https://t.me/Granduzb">Менеджер</a>'
            ' \n\n'
            '<a href="https://t.me/natijalar_uzb">Результаты бота</a>',
    'sec_back_menu': '⬅️'
}

LEXICON_HOW_WORK_BOT : dict[str, str] = {
    'text': '<strong>▪️Что такое GTRobot ?</strong>\n\n\n\n'
            'Основная задача GTRobot заключается в том, чтобы \n'
            'предоставить вам удобства для качественной торговли и \n'
            'достижения высоких результатов в сфере трейдинга.\n\n\n'
            '<strong>▪️Чем мне GTRobot поможет ?</strong>\n\n\n'
            'Чем мне GTRobot поможет ? GTRobot предоставляет готовые и \n'
            'проанализированные сигналы, а также ряд рабочих \n'
            'инструментов для независимого анализа, чтобы вы могли \n'
            'торговать качественно и прибыльно. \n\n\n'

            '<a href="https://www.gtrobot.ai/ru">Подробнее</a>',
    'sec_back_menu': '⬅️'
}

LEXICON_MINI_PACKAGE: dict[str, str] = {
    'text': '• Срок использования бота — 21 день\n'
            '• Служба технической поддержки',
    'pay_via_click': 'Оплатить через Click',
    'pay_via_uzum': 'Оплатить через UZUM SUM'
}

LEXICON_GOLD_PACKAGE: dict[str, str] = {
    'text': '• Срок использования бота — 4 месяца\n'
            '• Помощь куратора\n'
            '• Стратегия для фондового рынка (2 рабочих дня аренды)\n'
            '• Уроки по NFT|P2P и Трейдингу\n'
            '• Live Вебинар\n'
            '• GTR Club\n',
    'pay_via_click': 'Оплатить через Click',
    'pay_via_uzum': 'Оплатить через UZUM SUM'
}

LEXICON_STANDART_PACKAGE: dict[str, str] = {
    'text': '• Срок использования бота — 2 месяца\n'
            '• Помощь куратора\n'
            '• Уроки по трейдингу\n'
            '• GTR Club',
    'pay_via_click': 'Оплатить через Click',
    'pay_via_uzum': 'Оплатить через UZUM SUM'
}

LEXICON_PRO_PACKAGE: dict[str, str] = {
    'text': '• Срок использования бота — 8 месяцев\n'
            '• Помощь главного куратора\n'
            '• Стратегия для фондового рынка (5 рабочих дней аренды)\n'
            '• Уроки по NFT|P2P и Трейдингу\n'
            '• Помощь в создании портфеля\n'
            '• VIP Club\n'
            '• Премия за высокий результат 100$',
    'pay_via_click': 'Оплатить через Click',
    'pay_via_uzum': 'Оплатить через UZUM SUM'
}

LEXICON_VIP_PACKAGE: dict[str, str] = {
    'text': '• Срок использования бота — 1 год\n'
            '• Офлайн уроки (5 дней)\n'
            '• Live торговля & Контроль\n'
            '• Стратегия для фондового рынка (10 рабочих дней аренды)\n'
            '• Уроки по NFT|P2P и Трейдингу\n'
            '• Спот портфель Тимура Хасанова\n'
            '• VIP Club\n'
            '• Премия за высокий результат 200$\n'
            '• Ужин с Тимуром Хасановым\n'
            '• Возможность участвовать в проекте Счастливый подписчик 2024',
    'pay_via_click': 'Оплатить через Click',
    'pay_via_uzum': 'Оплатить через UZUM SUM'
}


LEXICON_P2P: dict[str, str] = {
    'text': '🤖Этот инструмент мгновенно сообщит вам об арбитражных \n'
            'связках, возникающих между биржами или на конкретной \n'
            'бирже в данный момент.',
    'selling_subscription': 'Использовать',
}
